a = sorted(set(input().lower().replace(' ', '')))
print(' '.join(map(str, a)))


# Необходимо написать программу, которая будет считывать со стандартного ввода строку и выводить 
# уникальные символы, встретившиеся в этой строке, в лексикографическом порядке по возрастанию. Символы 
# из входа нужно приводить к нижнему регистру. Символ пробела не нужно учитывать при формировании результата. 
# Выходные символы нужно разделять пробелом.
# Пример 2
# Входные данные

# Hello World!
# Выходные данные

# ! d e h l o r w